Terraform Plan output:
```
Terraform will perform the following actions:

  # aws_launch_template.default will be updated in-place
  ~ resource "aws_launch_template" "default" {
      ~ default_version         = 6 -> (known after apply)
        id                      = "lt-0b07d491046xxxxxx"
      ~ latest_version          = 6 -> (known after apply)
        name                    = "xxxxxxx-dev-us-west-2-eks-20210607052738916400000001"
        tags                    = {
            "Environment" = "dev"
            "Owner"       = "Subhankar_Pati"
            "Project"     = "xxxxxxxxx"
        }
        # (9 unchanged attributes hidden)


      ~ monitoring {
          ~ enabled = true -> false
        }


        # (4 unchanged blocks hidden)
    }

  # module.my-cluster.module.eks.module.node_groups.aws_eks_node_group.workers["example"] will be updated in-place
  ~ resource "aws_eks_node_group" "workers" {
        id              = "xxxxxxx-dev-us-west-2-eks:xxxxxxxx-dev-us-west-2-eks-worker-node-group"
        tags            = {
            "Environment"                                           = "dev"
            "Owner"                                                 = "Subhankar_Pati"
            "Project"                                               = "xxxxxxxxx"
            "k8s.io/cluster-autoscaler/enabled"                     = "true"
            "k8s.io/cluster-autoscaler/telemed2u-dev-us-west-2-eks" = "true"
        }
        # (15 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0b07d4910465xxxxx"
            name    = "xxxxxxxx-dev-us-west-2-eks-20210607052738916400000001"
          ~ version = "6" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```